CSI API ETABS v1

# cLoadCases Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cLoadCases

    Public Interface cLoadCases

    Dim instance As cLoadCases

    public interface class cLoadCases

    type cLoadCases =  interface end

The cLoadCases type exposes the following members.

Properties

| Name| Description
---|---|---
|
Buckling|
|
DirHistLinear|
|
DirHistNonlinear|
|
HyperStatic|
|
ModalEigen|
|
ModalRitz|
|
ModHistLinear|
|
ModHistNonlinear|
|
ResponseSpectrum|
|
StaticLinear|
|
StaticNonlinear|
|
StaticNonlinearStaged|
Top

Methods

| Name| Description
---|---|---
|
ChangeName|
|
Count|
|
Delete|  Deletes the specified
load case.
|
GetNameList|  Retrieves the names
of all defined load cases of the specified type.
|
GetTypeOAPI|
|
GetTypeOAPI_1|  Retrieves the case
type, design type, and auto flag for the specified load case
|
SetDesignType|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com